import React from "react";

const OurGoal = () => {
  return (
    <div className="flex flex-col gap-2">
      <p>
        ﺭﺳﺎﻟﺘﻨﺎ ﻓﻲ ﺳﻼﻡ ﻟﻴﺴﺖ ﻣﺠﺮﺩ ﻛﻠﻤﺎﺕ، ﺑﻞ ﻫﻲ ﺩﻋﻮﺓ ﺣﻘﻴﻘﻴﺔ ﻟﻜﻞ ﺭﻭﺡ ﺃﺭﻫﻘﺘﻬﺎ
        ﺍﻟﺤﻴﺎﺓ. ﻧﺆﻣﻦ ﺃﻥ ﻟﻜﻞ ﺷﺨﺺ ﺍﻟﺤﻖ ﻓﻲ ﻓﻬﻢ ﻧﻔﺴﻪ ﻭﻓﻬﻢ ﺍﻵﺧﺮﻳﻦ، ﻭﺃﻥ ﺍﻟﺼﺤﺔ ﺍﻟﻨﻔﺴﻴﺔ
        ﻟﻴﺴﺖ ﺭﻓﺎﻫﻴﺔ ﺑﻞ ﺿﺮﻭﺭﺓ. ﻧﺴﻌﻰ ﺇﻟﻰ ﺑﻨﺎﺀ ﺟﺴﺮ ﺑﻴﻦ ﺍﻟﻘﻠﻮﺏ، ﻟﻨﺰﺭﻉ ﻓﻲ ﻛﻞ ﻭﺍﺣﺪٍ
        ﻣﻨﺎ ﻳﻘﻴﻨﺎً ﺑﺄﻥ ﺍﻟﺘﻌﺎﻓﻲ ﻣﻤﻜﻦ، ﻭﺑﺄﻧﻨﺎ ﻟﺴﻨﺎ ﻭﺣﺪﻧﺎ ﻓﻲ ﻫﺬﻩ ﺍﻟﺮﺣﻠﺔ.
      </p>
      <p>
        ﺃﻫﺪﺍﻓﻨﺎﺑﻨﺎﺀ ﺍﻟﻮﻋﻲ ﻭﺍﻟﺘﻔﻬّﻢ: ﻧﺤﻦ ﻫﻨﺎ ﻟﻨﻔﺘﺢ ﺃﺑﻮﺍﺏ ﺍﻟﺤﻮﺍﺭ ﺣﻮﻝ ﺍﻟﺼﺤﺔ
        ﺍﻟﻨﻔﺴﻴﺔ، ﻭﻟﻨﺜﺒﺖ ﻟﻠﺠﻤﻴﻊ ﺃﻥ ﺍﻟﺤﺪﻳﺚ ﻋﻨﻬﺎ ﻟﻴﺲ ﻋﻴﺒﺎً، ﺑﻞ ﺧﻄﻮﺓ ﻧﺤﻮ ﺣﻴﺎﺓ ﺃﻓﻀﻞ،
        ﻭﺫﻟﻚ ﻣﻦ ﺧﻼﻝ ﺗﻮﻋﻴﺔ ﺍﻟﻤﺠﺘﻤﻊ ﺑﻘﻀﺎﻳﺎ ﺍﻟﺼﺤﺔ ﺍﻟﻨﻔﺴﻴﺔ ﻭﺗﺸﺠﻴﻊ ﻓﻬﻢ ﺃﻋﻤﻖ
        ﻟﻤﺸﺎﻛﻠﻬﺎ.ﺗﻘﺪﻳﻢ ﺍﻟﺪﻋﻢ: ﻛﻞ ﻓﺮﺩ ﻳﺴﺘﺤﻖ ﺍﻟﺪﻋﻢ، ﻭﻛﻞ ﺃﻟﻢ ﻳﺴﺘﺤﻖ ﺍﻻﻧﺼﺎﺕ. ﻧﺤﻦ ﻫﻨﺎ
        ﻟﺘﻘﺪﻳﻢ ﻳﺪ ﺍﻟﻌﻮﻥ ﻟﻤﻦ ﻳﺤﺘﺎﺟﻬﺎ، ﻭﺗﻌﻠﻴﻢ ﻣﻬﺎﺭﺍﺕ ﺗﺴﺎﻋﺪ ﻋﻠﻰ ﺍﻟﺘﻌﺎﻣﻞ ﻣﻊ ﺍﻟﺘﺤﺪﻳﺎﺕ
        ﺍﻟﻨﻔﺴﻴﺔ.ﺍﻟﺘﻮﻋﻴﺔ ﺑﺎﻹﺳﻌﺎﻑ ﺍﻟﻨﻔﺴﻲ: ﻓﻲ ﺃﻭﻗﺎﺕ ﺍﻷﺯﻣﺎﺕ، ﻗﺪ ﻳﻜﻮﻥ ﺍﻟﺪﻋﻢ ﺍﻟﻨﻔﺴﻲ ﻫﻮ
        ﻃﻮﻕ ﺍﻟﻨﺠﺎﺓ. ﻧﺆﻣﻦ ﺑﺄﻥ ﺍﻹﺳﻌﺎﻑ ﺍﻟﻨﻔﺴﻲ ﻻ ﻳﻘﻞ ﺃﻫﻤﻴﺔ ﻋﻦ ﺍﻹﺳﻌﺎﻑ ﺍﻟﺠﺴﺪﻱ، ﻭﻧﻘﺪﻡ
        ﻟﻜﻞ ﻣﻦ ﻳﺮﻳﺪ ﺍﻟﻤﻌﺮﻓﺔ ﺃﺩﻭﺍﺕ ﺗُﻤﻜﻨﻪ ﻣﻦ ﻣﺴﺎﻋﺪﺓ ﺍﻵﺧﺮﻳﻦ.ﺗﺸﺠﻴﻊ ﺍﻟﺤﻮﺍﺭ: ﺑﺎﻟﺤﻮﺍﺭ
        ﻧﺘﺠﺎﻭﺯ ﺍﻟﺨﻮﻑ، ﻭﻧﻜﺴﺮ ﺍﻟﺼﻤﺖ. ﻧﺴﻌﻰ ﻟﺨﻠﻖ ﻣﺴﺎﺣﺔ ﺁﻣﻨﺔ، ﺣﻴﺚ ﻳﻤﻜﻦ ﻟﻜﻞ ﺷﺨﺺ
        ﺍﻟﺘﻌﺒﻴﺮ ﻋﻦ ﺁﻻﻣﻪ ﺩﻭﻥ ﺧﻮﻑ ﻣﻦ ﺍﻟﻮﺻﻤﺔ.
      </p>
    </div>
  );
};

export default OurGoal;
