import {
  Accordion,
  AccordionItem,
  AccordionTrigger,
  AccordionContent,
} from "@/components/ui/accordion";
import React from "react";

const Faq = () => {
  const faqs = [
    {
      question: "ماهي مبادرة سلام ؟",
      answer:
        "ﻣﺒﺎﺩﺭﺓ ﺳﻼﻡ ﻫﻲ ﻣﺒﺎﺩﺭﺓ ﺗﻄﻮﻋﻴﺔ ﺗُﻌﻨﻰ ﺑﻨﺸﺮ ﺍﻟﻮﻋﻲ ﺣﻮﻝ ﻗﻀﺎﻳﺎ ﺍﻟﺼﺤﺔ ﺍﻟﻨﻔﺴﻴﺔ، ﻭﻛﺴﺮ ﺍﻟﻮﺻﻤﺔ ﺍﻻﺟﺘﻤﺎﻋﻴﺔ ﺍﻟﻤﺮﺗﺒﻄﺔ ﺑﻬﺎ، ﻭﺗﻘﺪﻳﻢ ﺍﻟﺪﻋﻢ ﻭﺍﻟﻤﻌﻠﻮﻣﺎﺕ ﺑﻄﺮﻕ ﻣﺒﺘﻜﺮﺓ ﺗﺴﺘﻬﺪﻑ ﺍﻟﺸﺒﺎﺏ ﻭﺍﻟﻔﺌﺎﺕ ﺍﻟﻤﺨﺘﻠﻔﺔ ﻓﻲ ﺍﻟﻤﺠﺘﻤﻊ.",
    },
    {
      question: "ﻣﺎ ﻫﻲ ﺍﻷﻧﺸﻄﺔ ﺍﻟﺘﻲ ﺗﻘﺪﻣﻬﺎ ﻣﺒﺎﺩﺭﺓ ﺳﻼﻡ ؟",
      answer:
        'ﻧﻘﺪﻡ ﻭﺭﺷﺎﺕ ﻋﻤﻞ، ﺣﻤﻼﺕ ﺗﻮﻋﻮﻳﺔ ﻋﻠﻰ ﻭﺳﺎﺋﻞ ﺍﻟﺘﻮﺍﺻﻞ ﺍﻻﺟﺘﻤﺎﻋﻲ، ﻭﻣﺠﻤﻮﻋﺎﺕ ﺣﻮﺍﺭﻳﺔ ﺁﻣﻨﺔ ﻟﻤﺸﺎﺭﻛﺔ ﺍﻟﺘﺠﺎﺭﺏ ﻭﺍﻟﺪﻋﻢ ﺍﻟﻤﺘﺒﺎﺩﻝ. ﻛﻤﺎ ﻧﻘﻮﻡ ﺑﺘﻨﻈﻴﻢ ﻓﻌﺎﻟﻴﺎﺕ ﻣﺜﻞ ﻣﻌﺮﺽ "ﺣﺪﺙ ﻭﺭﺍﺀ ﺍﻟﺴﺘﺎﺭ" ﺍﻟﺬﻱ ﻳﻬﺪﻑ ﻟﺘﻘﺪﻳﻢ ﻣﻌﻠﻮﻣﺎﺕ ﻋﻠﻤﻴﺔ ﻋﻦ ﺍﻷﻣﺮﺍﺽ ﺍﻟﻨﻔﺴﻴﺔ ﻭﺗﺼﺤﻴﺢ ﺍﻟﻤﻔﺎﻫﻴﻢ ﺍﻟﺨﺎﻃﺌﺔ ﺣﻮﻟﻬﺎ.',
    },
    {
      question: "ﻛﻴﻒ ﻳﻤﻜﻨﻨﻲ ﺍﻟﺘﺴﺠﻴﻞ ﻟﺤﻀﻮﺭ ﺍﻟﻮﺭﺷﺎﺕ ؟",
      answer:
        "ﻳﻤﻜﻨﻚ ﺍﻟﺘﺴﺠﻴﻞ ﺑﺴﻬﻮﻟﺔ ﻣﻦ ﺧﻼﻝ ﻣﻞﺀ ﺍﺳﺘﻤﺎﺭﺓ Google ﺍﻟﻤﺘﺎﺣﺔ ﻋﻠﻰ ﺍﻟﻤﻮﻗﻊ ﺿﻤﻦ ﻗﺴﻢ ﻭﺭﺵ ﺍﻟﻌﻤﻞ. ﺑﻌﺪ ﺍﻟﺘﺴﺠﻴﻞ، ﺳﻴﺘﻮﺍﺻﻞ ﻣﻌﻚ ﻓﺮﻳﻖ ﺍﻟﻤﻮﺍﺭﺩ ﺍﻟﺒﺸﺮﻳﺔ ﻟﺘﺄﻛﻴﺪ ﻣﺸﺎﺭﻛﺘﻚ ﻭﺗﺰﻭﻳﺪﻙ ﺑﺠﻤﻴﻊ ﺍﻟﺘﻔﺎﺻﻴﻞ.",
    },
    {
      question: "ﻫﻞ ﻳﻤﻜﻨﻨﻲ ﺍﻟﺘﻄﻮﻉ ﻣﻌﻜﻢ؟ ﻭﻛﻴﻒ ؟",
      answer:
        "ﻧﻌﻢ، ﻧﺮﺣﺐ ﺑﺠﻤﻴﻊ ﺍﻷﻓﺮﺍﺩ ﺍﻟﺮﺍﻏﺒﻴﻦ ﻓﻲ ﺩﻋﻢ ﺭﺳﺎﻟﺘﻨﺎ. ﻳﻤﻜﻨﻚ ﺍﻟﺘﻘﺪﻳﻢ ﻟﻠﺘﻄﻮﻉ ﻣﻦ ﺧﻼﻝ ﺍﺳﺘﻤﺎﺭﺓ ﺍﻟﺘﻄﻮﻉ ﺍﻟﻤﺘﺎﺣﺔ ﻋﻠﻰ ﺍﻟﻤﻮﻗﻊ. ﻓﺮﻳﻖ ﺍﻟﻤﻮﺍﺭﺩ ﺍﻟﺒﺸﺮﻳﺔ ﺳﻴﺘﻮﺍﺻﻞ ﻣﻌﻚ ﺑﻌﺪ ﺗﻘﺪﻳﻢ ﺍﻟﻄﻠﺐ ﻟﺘﺤﺪﻳﺪ ﺍﻷﺩﻭﺍﺭ ﺍﻟﻤﻨﺎﺳﺒﺔ.",
    },
    {
      question: "ﻫﻞ ﺍﻟﻮﺭﺷﺎﺕ ﻣﺠﺎﻧﻴﺔ ﺃﻡ ﻣﺪﻓﻮﻋﺔ ؟",
      answer:
        "ﻣﻌﻈﻢ ﻭﺭﺷﺎﺗﻨﺎ ﻣﺠﺎﻧﻴﺔ، ﺇﺫ ﻧﺴﻌﻰ ﻟﺠﻌﻞ ﺍﻟﻤﻌﺮﻓﺔ ﺍﻟﻨﻔﺴﻴﺔ ﻭﺍﻟﺪﻋﻢ ﻣﺘﺎﺣﻴﻦ ﻟﻠﺠﻤﻴﻊ. ﻭﻣﻊ ﺫﻟﻚ، ﻗﺪ ﺗﻜﻮﻥ ﻫﻨﺎﻙ ﺑﻌﺾ ﺍﻟﻮﺭﺷﺎﺕ ﺃﻭ ﺍﻟﻔﻌﺎﻟﻴﺎﺕ ﺍﻟﺘﻲ ﺗﺤﺘﺎﺝ ﺇﻟﻰ ﺭﺳﻮﻡ ﺑﺴﻴﻄﺔ ﻟﺪﻋﻢ ﺍﺳﺘﻤﺮﺍﺭ ﺍﻷﻧﺸﻄﺔ.",
    },
    {
      question: "ﻫﻞ ﻫﻨﺎﻙ ﺩﻋﻢ ﺧﺎﺹ ﻟﻤﻦ ﻳﻌﺎﻧﻮﻥ ﻣﻦ ﻣﺸﺎﻛﻞ ﻧﻔﺴﻴﺔ ؟",
      answer:
        "ﻧﻌﻢ، ﻧﺴﻌﻰ ﻟﺘﻮﻓﻴﺮ ﺍﻟﺪﻋﻢ ﻭﺍﻟﻤﻌﻠﻮﻣﺎﺕ ﻟﻸﻓﺮﺍﺩ ﺍﻟﺬﻳﻦ ﻳﻌﺎﻧﻮﻥ ﻣﻦ ﻣﺸﺎﻛﻞ ﻧﻔﺴﻴﺔ. ﻛﻤﺎ ﻧﻮﺟﻬﻬﻢ ﺇﻟﻰ ﺍﻟﺠﻬﺎﺕ ﺍﻟﻤﺨﺘﺼﺔ ﻟﺘﻠﻘﻲ ﺍﻟﺮﻋﺎﻳﺔ ﺍﻟﻤﻨﺎﺳﺒﺔ، ﻭﻧﺘﻌﺎﻭﻥ ﻣﻊ ﺃﺧﺼﺎﺋﻴﻴﻦ ﻧﻔﺴﻴﻴﻦ ﻳﻤﻜﻦ ﺍﻟﺘﻮﺍﺻﻞ ﻣﻌﻬﻢ ﻋﻨﺪ ﺍﻟﺤﺎﺟﺔ.",
    },
    {
      question: "ﻛﻴﻒ ﻳﻤﻜﻨﻨﻲ ﺍﻟﺘﻮﺍﺻﻞ ﻣﻊ ﺍﻷﺧﺼﺎﺋﻴﻴﻦ ﺍﻟﻨﻔﺴﻴﻴﻦ ﻣﻦ ﺧﻼﻝ ﺍﻟﻤﺒﺎﺩﺭﺓ ؟",
      answer:
        'ﻳﻤﻜﻨﻜﻢ ﻃﺮﺡ ﺍﺳﺘﻔﺴﺎﺭﺍﺗﻜﻢ ﺣﻮﻝ ﺍﻟﺼﺤﺔ ﺍﻟﻨﻔﺴﻴﺔ ﻋﺒﺮ ﻗﺴﻢ "ﺍﺳﺄﻝ ﺳﻼﻡ"، ﺣﻴﺚ ﻳﺠﻴﺐ ﺍﻷﺧﺼﺎﺋﻴﻮﻥ ﺍﻟﻨﻔﺴﻴﻮﻥ ﻋﻦ ﺃﺳﺌﻠﺘﻜﻢ ﺑﺸﻜﻞ ﻋﻠﻤﻲ ﻭﻣﻬﻨﻲ. ﻳﻤﻜﻦ ﺃﻳﻀًﺎ ﻃﻠﺐ ﺍﻹﺭﺷﺎﺩ ﻟﻠﺘﻮﺍﺻﻞ ﺍﻟﻤﺒﺎﺷﺮ ﻣﻊ ﻣﺨﺘﺼﻴﻦ.',
    },
    {
      question: "ﻫﻞ ﺗﻘﺪﻣﻮﻥ ﺍﺳﺘﺸﺎﺭﺍﺕ ﻓﺮﺩﻳﺔ ﺃﻭ ﺧﺎﺻﺔ ؟",
      answer:
        "ﻧﺤﻦ ﻻ ﻧﻘﺪﻡ ﺍﺳﺘﺸﺎﺭﺍﺕ ﻓﺮﺩﻳﺔ ﺑﺸﻜﻞ ﻣﺒﺎﺷﺮ، ﻟﻜﻨﻨﺎ ﻧﻮﺟﻪ ﺍﻷﻓﺮﺍﺩ ﺍﻟﺮﺍﻏﺒﻴﻦ ﺑﺬﻟﻚ ﺇﻟﻰ ﺃﺧﺼﺎﺋﻴﻴﻦ ﻣﻌﺘﻤﺪﻳﻦ ﻓﻲ ﻣﺠﺎﻝ ﺍﻟﺼﺤﺔ ﺍﻟﻨﻔﺴﻴﺔ ﻟﻠﺤﺼﻮﻝ ﻋﻠﻰ ﺍﻟﺪﻋﻢ ﺍﻟﻼﺯﻡ.",
    },
    {
      question: 'ﻣﺎ ﻫﻮ ﻣﺴﺘﻘﺒﻞ ﻣﺒﺎﺩﺭﺓ "ﺳﻼﻡ" ؟',
      answer:
        'ﺗﺴﻌﻰ ﻣﺒﺎﺩﺭﺓ "ﺳﻼﻡ" ﺇﻟﻰ ﺍﻟﺘﻮﺳﻊ ﻭﺍﻟﻮﺻﻮﻝ ﺇﻟﻰ ﻓﺌﺎﺕ ﺃﻛﺒﺮ ﻣﻦ ﺍﻟﻤﺠﺘﻤﻊ، ﻋﺒﺮ ﺗﻨﻈﻴﻢ ﺍﻟﻤﺰﻳﺪ ﻣﻦ ﺍﻟﻔﻌﺎﻟﻴﺎﺕ ﻭﻭﺭﺵ ﺍﻟﻌﻤﻞ ﺍﻟﺘﻮﻋﻮﻳﺔ. ﻧﻌﻤﻞ ﻋﻠﻰ ﺑﻨﺎﺀ ﺷﺮﺍﻛﺎﺕ ﻣﻊ ﻣﺨﺘﺼﻴﻦ ﻭﻣﺆﺳﺴﺎﺕ ﻟﺪﻋﻢ ﺍﻟﺼﺤﺔ ﺍﻟﻨﻔﺴﻴﺔ، ﻭﻧﺴﻌﻰ ﻟﺘﻄﻮﻳﺮ ﻣﻨﺼﺎﺕ ﺗﻔﺎﻋﻠﻴﺔ ﻭﻣﻮﺍﺭﺩ ﺗﻌﻠﻴﻤﻴﺔ ﻳﻤﻜﻦ ﺍﻟﻮﺻﻮﻝ ﺇﻟﻴﻬﺎ ﺑﺴﻬﻮﻟﺔ. ﺭﺅﻳﺘﻨﺎ ﻫﻲ ﺃﻥ ﻳﺼﺒﺢ "ﺳﻼﻡ" ﻣﺮﺟﻌًﺎ ﻣﺠﺘﻤﻌﻴًﺎ ﻭﺩﺍﻋﻤًﺎ ﻟﻜﻞ ﻣﻦ ﻳﺤﺘﺎﺝ ﺇﻟﻰ ﺍﻟﺘﻮﺟﻴﻪ ﺃﻭ ﺍﻟﺪﻋﻢ ﺍﻟﻨﻔﺴﻲ، ﻭﺃﻥ ﻳﺴﺎﻫﻢ ﻓﻲ ﺧﻠﻖ ﻣﺠﺘﻤﻊ ﺃﻛﺜﺮ ﺗﻔﻬﻤًﺎ ﻭﺩﻋﻤًﺎ ﻟﻘﻀﺎﻳﺎ ﺍﻟﺼﺤﺔ ﺍﻟﻨﻔﺴﻴﺔ.',
    },
    {
      question: "ﻣﺎ ﻫﻲ ﻣﺪﺓ ﺍﻟﻮﺭﺷﺎﺕ ﻭﻋﺪﺩ ﺍﻟﺠﻠﺴﺎﺕ ؟",
      answer:
        "ﺗﺨﺘﻠﻒ ﻣﺪﺓ ﺍﻟﻮﺭﺷﺎﺕ ﻭﻋﺪﺩ ﺍﻟﺠﻠﺴﺎﺕ ﺣﺴﺐ ﺍﻟﻤﻮﺿﻮﻉ ﺍﻟﻤﻘﺪﻡ. ﺑﻌﺾ ﺍﻟﻮﺭﺷﺎﺕ ﻗﺪ ﺗﻜﻮﻥ ﺟﻠﺴﺔ ﻭﺍﺣﺪﺓ، ﺑﻴﻨﻤﺎ ﻗﺪ ﺗﺤﺘﺎﺝ ﻭﺭﺷﺎﺕ ﺃﺧﺮﻯ ﺇﻟﻰ ﻋﺪﺓ ﺟﻠﺴﺎﺕ ﻟﺘﺤﻘﻴﻖ ﺍﻻﺳﺘﻔﺎﺩﺓ ﺍﻟﻜﺎﻣﻠﺔ.",
    },
    {
      question: "ﻛﻴﻒ ﻳﻤﻜﻨﻨﻲ ﺍﻟﻤﺴﺎﻫﻤﺔ ﻓﻲ ﺩﻋﻢ ﺍﻟﻤﺒﺎﺩﺭﺓ ؟",
      answer:
        'ﻳﻤﻜﻨﻜﻢ ﺍﻟﻤﺴﺎﻫﻤﺔ ﺑﺪﻋﻢ ﺍﻟﻤﺒﺎﺩﺭﺓ ﻋﻦ ﻃﺮﻳﻖ ﺍﻟﺘﻄﻮﻉ، ﻧﺸﺮ ﻣﺤﺘﻮﻯ ﺍﻟﻤﺒﺎﺩﺭﺓ، ﺃﻭ ﺣﺘﻰ ﺗﻘﺪﻳﻢ ﺩﻋﻢ ﻣﺎﺩﻱ. ﻳﻤﻜﻨﻜﻢ ﺍﻟﺘﻮﺍﺻﻞ ﻣﻌﻨﺎ ﻟﻤﻌﺮﻓﺔ ﺍﻟﻤﺰﻳﺪ ﺣﻮﻝ ﻛﻴﻔﻴﺔ ﺩﻋﻢ "ﺳﻼﻡ".',
    },
    {
      question: "ﻫﻞ ﻳﺘﻢ ﺍﻻﺣﺘﻔﺎﻅ ﺑﺴﺮﻳﺔ ﺍﻟﻤﻌﻠﻮﻣﺎﺕ ﺍﻟﻤﻘﺪﻣﺔ ﻓﻲ ﺍﺳﺘﻤﺎﺭﺍﺕ ﺍﻟﺘﺴﺠﻴﻞ ؟",
      answer:
        "ﻧﻌﻢ، ﻧﻠﺘﺰﻡ ﺑﺴﺮﻳﺔ ﺍﻟﻤﻌﻠﻮﻣﺎﺕ ﺍﻟﻤﻘﺪﻣﺔ ﻭﻧﻀﻤﻦ ﻋﺪﻡ ﻣﺸﺎﺭﻛﺘﻬﺎ ﻣﻊ ﺃﻃﺮﺍﻑ ﺛﺎﻟﺜﺔ. ﻓﺮﻳﻘﻨﺎ ﻳﺤﺘﺮﻡ ﺧﺼﻮﺻﻴﺔ ﺟﻤﻴﻊ ﺍﻟﻤﺸﺎﺭﻛﻴﻦ ﻭﺍﻟﻤﺘﻄﻮﻋﻴﻦ.",
    },
    {
      question: "ﻛﻴﻒ ﻳﻤﻜﻨﻨﻲ ﺍﻟﺤﺼﻮﻝ ﻋﻠﻰ ﺁﺧﺮ ﺍﻷﺧﺒﺎﺭ ﻭﺍﻟﺘﺤﺪﻳﺜﺎﺕ ﺣﻮﻝ ﺍﻟﻤﺒﺎﺩﺭﺓ ؟",
      answer:
        "ﺗﺎﺑﻌﻮﻧﺎ ﻋﻠﻰ ﻭﺳﺎﺋﻞ ﺍﻟﺘﻮﺍﺻﻞ ﺍﻻﺟﺘﻤﺎﻋﻲ ﻟﻼﻃﻼﻉ ﻋﻠﻰ ﺁﺧﺮ ﺍﻷﺧﺒﺎﺭ ﻭﺍﻟﺘﺤﺪﻳﺜﺎﺕ. ﻛﻤﺎ ﻳﻤﻜﻨﻜﻢ ﺍﻻﺷﺘﺮﺍﻙ ﻓﻲ ﻗﺎﺋﻤﺔ ﺍﻟﺒﺮﻳﺪ ﺍﻹﻟﻜﺘﺮﻭﻧﻲ ﺍﻟﺨﺎﺻﺔ ﺑﻨﺎ ﻟﺘﺼﻠﻜﻢ ﺃﺣﺪﺙ ﺍﻟﻤﻌﻠﻮﻣﺎﺕ ﺣﻮﻝ ﺍﻷﻧﺸﻄﺔ ﻭﺍﻟﻔﻌﺎﻟﻴﺎﺕ.",
    },
  ];
  return (
    <div>
      <Accordion type="single" collapsible>
        {faqs.map((faq) => (
          <AccordionItem key={faq.question} value={faq.question}>
            <AccordionTrigger>{faq.question}</AccordionTrigger>
            <AccordionContent>{faq.answer}</AccordionContent>
          </AccordionItem>
        ))}
      </Accordion>
    </div>
  );
};

export default Faq;
